# PointVisibilityParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointVisibilityParam Property
ParameterTypeId Class See Also
---
"Visibility/Graphics Overrides"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointVisibilityParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointVisibilityParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointVisibilityParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace